tutorials/TestCase/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (phase1 phase2);

phase1
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             7874;
    cp  100.0;//500;
    kappa  80.0; 
    Tsolidus    1920;
    Tliquidus   1970;
    LatentHeat  500.0;//270000;
    beta    1.0e-5;

    Tvap 3000.0;
    Mm 0.05;
LatentHeatVap 600000.0;

}

phase2
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
    cp  1000;
    kappa  1.0;
    Tsolidus    1.0;
    Tliquidus   10.0;
    LatentHeat  1.0;
    beta    5.0e-4;

    Tvap 5.0;
    Mm 0.02;
LatentHeatVap 50.0;
}

sigma            1.5;
dsigmadT	-2e-4;
p0		100000.0;
//Tvap 3000.0;

// ************************************************************************* //
