tutorials/TestCase/Allrun
#!/bin/sh

cp -r initial 0
blockMesh
setFields
decomposePar
mpirun.openmpi -np 6 FusionFoam -parallel >log &
